{
  "personal_projects": [
    {
      "index": 1,
      "title": "Personal Website",
      "role": "Developer",
      "content": "Welcome to my personal portfolio website repository. This site showcases selected projects, technologies I’ve worked with, and my experience as a Web Developer.",
      "stack": [
        "Typescript",
        "React.js",
        "Tailwindcss",
        "Next.js"
      ],
      "links": {
        "repo": "https://github.com/ichiklaus/Yelav",
        "site": "https://yelav.netlify.app/"
      },
      "img": [
        "/space-turism-desktop.jpeg",
        "/space-turism-mobile.jpeg"
      ]
    },
    {
      "index": 2,
      "title": "SPA Prototype With jQuery",
      "role": "Developer",
      "content": "Single Page Application (SPA) prototype built with jQuery, focused on demonstrating a simple authentication flow and dashboard layout without relying on modern frontend frameworks. It serves as an example of how to structure a modular, maintainable jQuery-based SPA with basic routing and views.",
      "stack": [
        "jQuery",
        "Webpack",
        "Bootstrap",
        "Firebase"
      ],
      "links": {
        "repo": "https://github.com/ichiklaus/spa-prototype-w-jquery",
        "site": ""
      },
      "img": [
        "/space-turism-desktop.jpeg",
        "/space-turism-mobile.jpeg"
      ]
    },
    {
      "index": 3,
      "title": "Space tourism multi-page website",
      "role": "Frontend Developer",
      "content": "This is a multi-page website built with react-router and animated with Framer Motion.",
      "stack": [
        "React",
        "React-Router",
        "Framer Motion",
        "Netlify"
      ],
      "links": {
        "repo": "https://github.com/ichiklaus/space-tourism-website-main/",
        "site": "https://ichiklaus-space-tourism.netlify.app/"
      },
      "img": [
        "/space-turism-desktop.jpeg",
        "/space-turism-mobile.jpeg"
      ]
    },
    {
      "index": 4,
      "title": "Clipboard Landing Page",
      "role": "Frontend Developer",
      "content": "A simple landing page for a fictional digital product built with semantic HTML and custom CSS.",
      "stack": [
        "HTML5",
        "CSS",
        "GitHub Pages"
      ],
      "links": {
        "repo": "https://github.com/ichiklaus/fem-clipboard/",
        "site": "https://ichiklaus.github.io/fem-clipboard/"
      },
      "img": [
        "/clipboard-landing.png"
      ]
    }
  ],
  "experience": [
    {
      "key": "acs",
      "company": "AlphaCrew Studio",
      "link": "https://alphacrewstudio.com/",
      "role": "Web developer",
      "period": {
        "start": "2022-07-28",
        "end": ""
      },
      "tasks2": [
        "Collaborated in the development of a full-stack application, a Video Marketing Platform, where I built several modules for the dashboard. I was responsible for developing an API using Node.js, Express, and EJS to dynamically render page templates, as well as handling the frontend and using Firebase as the backend.",
        "Developed a comprehensive dashboard for the Applicant Management module on top of the organization's platform, improving hiring process and management capabilities.",
        "Integrated various modules, including Time Clocking, Schedule Builder, and Payroll System, into the organization's platform, significantly enhancing operational efficiency.",
        "Developed websites using CMS solutions such as WordPress and other technologies, as well as building custom-coded websites tailored to specific client needs",
        "Implemented responsive designs to ensure cross-browser compatibility and improved user experience across web applications and websites."
      ],
      "tasks": [
        "Developed full-stack features for a Video Marketing platform, building responsive interfaces and scalable backend services.",
        "Led development of business management modules like applicant tracking, payroll, and scheduling systems.",
        "Automated operational tasks using Google Cloud Scheduler and email workflows.",
        "Optimized frontend performance and cross-browser compatibility.",
        "Customized WordPress frontend solutions, adapting designs and interactions using themes, page builders, and plugins to meet client needs."
      ],
      "tags": [
        "Wordpress",
        "jQuery",
        "Javascript",
        "HTML & CSS",
        "Parcel.js",
        "Vite",
        "Next.js",
        "Webpack",
        "Firebase",
        "Node.js",
        "Express.js",
        "EJS"
      ]
    }
  ]
}